tap 'homebrew/core'
tap 'homebrew/bundle'
brew 'autoconf' # dependency of ruby-build
brew 'awscli'
brew 'awslogs'
brew 'coffeescript'
brew 'elm'
brew 'gh'
brew 'git'
brew 'glib' # dependency of graphviz
brew 'go'
brew 'gobject-introspection' # dependency of graphviz
brew 'graphviz'
brew 'icu4c' # dependency of coffeescript, node, graphviz
brew 'jq'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'nvm'
brew 'openssl@1.1' # dependency of ruby-build awscli, awslogs, graphviz, mysql, redis, swi-prolog, wget
brew 'pango' # dependency of graphviz
brew 'pkg-config' # dependency of node, graphviz, rbenv, ruby-build
brew 'python@3.8' # dependency of graphviz
brew 'rbenv'
brew 'redis'
brew 'ruby-build'
brew 'stow'
brew 'swi-prolog'
brew 'tflint'
brew 'the_silver_searcher'
brew 'wget'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform', link: true

tap 'homebrew/cask'
cask '1password'
cask 'battle-net'
cask 'cyberduck'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hex-fiend'
cask 'paw'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vlc'
cask 'zoom'

mas 'Amphetamine', id: 937_984_704
mas 'HTTP Client', id: 418_138_339
mas 'Reeder', id: 1_529_448_980
mas 'Wipr', id: 1_320_666_476
mas 'Xcode', id: 497_799_835
