# Brew core packages
tap 'homebrew/core'
brew 'autoconf'                   # dependency of ruby-build formula
brew 'awscli'
brew 'coffeescript'
brew 'go'
brew 'graphviz'
brew 'icu4c'                      # dependency of node formulae
brew 'jq'
brew 'mas'
brew 'mysql'
brew 'node'                       # dependency of coffeescript formula
brew 'nvm'
brew 'openssl'                    # dependency of node, ruby-build formulae
brew 'packer'
brew 'pkg-config'                 # dependency of node, ruby-build formulae
brew 'rbenv'
brew 'redis'
brew 'ruby-build'
brew 'stow'
brew 'swi-prolog'
brew 'terraform'

# Codeclimate requires a running Docker daemon during installation
# https://github.com/codeclimate/codeclimate
# tap 'codeclimate/formulae'
# brew 'codeclimate/formulae/codeclimate'

# Casks
tap 'caskroom/cask'
# cask '1password'
cask 'caffeine'
cask 'chefdk'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'elm-platform'
cask 'flux'
cask 'google-chrome'
cask 'hex-fiend'
cask 'hipchat'
cask 'paw'
cask 'sequel-pro'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'

tap 'caskroom/drivers'
cask 'caskroom/drivers/xbox360-controller-driver-unofficial'

tap 'caskroom/versions'
cask 'caskroom/versions/1password-beta'

# Mac App Store
mas 'HTTP Client', id: 418138339
mas 'Reeder',      id: 880001334
mas 'Xcode',       id: 497799835
