tap 'homebrew/core'
tap 'homebrew/bundle'
brew 'autoconf'                   # dependency of ruby-build formula
brew 'awscli'
brew 'awslogs'
brew 'coffeescript'
brew 'elm'
brew 'git'
brew 'go'
brew 'graphviz'
brew 'icu4c'                      # dependency of node formula
brew 'jq'
brew 'mysql'
brew 'node'
brew 'nvm'
brew 'openssl@1.1'                # dependency of node, ruby-build formula
brew 'pkg-config'                 # dependency of node, ruby-build formula
brew 'rbenv'
brew 'redis'
brew 'ruby-build'
brew 'stow'
brew 'swi-prolog'
brew 'terraform'
brew 'tflint'
brew 'wget'

tap 'homebrew/cask'
cask '1password'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'hex-fiend'
cask 'paw'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vlc'

tap 'homebrew/cask-drivers'
cask 'xbox360-controller-driver-unofficial'

tap 'mas-cli/tap'
brew 'mas-cli/tap/mas'

# Mac App Store
mas 'Amphetamine', id: 937_984_704
mas 'HTTP Client', id: 418_138_339
mas 'Reeder',      id: 144_941_248_2
mas 'Wipr',        id: 132_066_647_6
mas 'Xcode',       id: 497_799_835
